# GetZoneEquipmentData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ZoneEquipment..::..GetZoneEquipmentData Method
ZoneEquipment Class See Also
---
Gets the zone equipment data.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public ZoneEquipmentData GetZoneEquipmentData()
```

Visual Basic
---
```text
Public Function GetZoneEquipmentData As ZoneEquipmentData
```

Visual C++
---
```text
public:
ZoneEquipmentData^ GetZoneEquipmentData()
```

# See Also
ZoneEquipment Class
Autodesk.Revit.DB.Mechanical Namespace